# 30 Oct.

In [2]:
import sqlite3
db=sqlite3.connect('student_database.db')

In [3]:
cursor=db.cursor()

In [4]:
results= cursor.execute('SELECT * FROM student_learningdata')
for r in results:
    print(r)

(1234, 'abc9@gmai.com', 'data sciende', 50000)
(987654321, 'qwerty123@gmail.com', 'data science', 50000)
(482959, 'mukul@gmail.com', 'software developer', 100000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [20]:
ds=cursor.execute("SELECT *FROM student_learningdata WHERE course_name = 'Digital Marketing'")
for result in ds:
    print(result)

(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)

In [21]:
sql="SELECT *FROM student_learningdata WHERE course_name = 'Data Science'"
result= cursor.execute(sql)
for row in result:
    print(row)

(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [38]:
fee="SELECT * FROM student_learningdata WHERE fee_paid >= 70000"
results=cursor.execute(fee)
for paid in results:
    print(paid)

(482959, 'mukul@gmail.com', 'software developer', 100000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)

In [39]:
delete=cursor.execute("DELETE FROM student_learningdata WHERE email_id = 'abc9@gmai.com'")

In [40]:
new=cursor.execute('select * from student_learningdata')
for d in new:
    print(d)

(987654321, 'qwerty123@gmail.com', 'data science', 50000)
(482959, 'mukul@gmail.com', 'software developer', 100000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

# order by

In [41]:
order=cursor.execute("select * from student_learningdata order by fee_paid")
for o in order:
    print(o)

(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(987654321, 'qwerty123@gmail.com', 'data science', 50000)
(482959, 'mukul@gmail.com', 'software developer', 100000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)

In [42]:
order=cursor.execute("select * from student_learningdata order by fee_paid desc")
for o in order:
    print(o)

(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(482959, 'mukul@gmail.com', 'software developer', 100000)
(987654321, 'qwerty123@gmail.com', 'data science', 50000)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)

In [45]:
cursor.execute('UPDATE student_learningdata SET course_name= "Digital Marketing" WHERE phone_number= 9988776622')

In [46]:
update=cursor.execute('SELECT *from student_learningdata')
for new in update:
    print(new)

(987654321, 'qwerty123@gmail.com', 'data science', 50000)
(482959, 'mukul@gmail.com', 'software developer', 100000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Digital Marketing', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [47]:
update=cursor.execute('SELECT *from student_learningdata WHERE phone_number=9988776622')
for new in update:
    print(new)

(9988776622, 'student22@gmail.com', 'Digital Marketing', 23000)

In [50]:
notify=("SELECT phone_number,email_id,fee_paid FROM student_learningdata WHERE course_name='Data Science' AND fee_paid<=50000")
new=cursor.execute(notify)
for n in new:
    print(n)

(9988776606, 'student6@gmail.com', 34000)
(9988776607, 'student7@gmail.com', 33000)
(9988776609, 'student9@gmail.com', 40000)
(9988776611, 'student11@gmail.com', 41500)
(9988776614, 'student14@gmail.com', 24000)
(9988776615, 'student15@gmail.com', 23000)
(9988776617, 'student17@gmail.com', 29000)
(9988776623, 'student23@gmail.com', 24000)

In [51]:
notify=("SELECT phone_number,course_name,fee_paid FROM student_learningdata WHERE course_name='Data Science' AND fee_paid<=50000")
new=cursor.execute(notify)
for n in new:
    print(n)

(9988776606, 'Data Science', 34000)
(9988776607, 'Data Science', 33000)
(9988776609, 'Data Science', 40000)
(9988776611, 'Data Science', 41500)
(9988776614, 'Data Science', 24000)
(9988776615, 'Data Science', 23000)
(9988776617, 'Data Science', 29000)
(9988776623, 'Data Science', 24000)

In [54]:
cursor.execute("UPDATE student_learningdata SET fee_paid=110000 WHERE phone_number IN (9988776611,9988776609)")

In [55]:
p= cursor.execute('select * from student_learningdata where fee_paid=110000')
for n in p:
    print(n)

(9988776609, 'student9@gmail.com', 'Data Science', 110000)
(9988776611, 'student11@gmail.com', 'Data Science', 110000)

In [57]:
e=cursor.execute("select *from student_learningdata WHERE phone_number BETWEEN 9988776604 AND 9988776609")
for c in e:
    print (c)

(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 110000)

In [61]:
cursor.execute("update student_learningdata SET course_name='tablue' WHERE phone_number BETWEEN 9988776604 AND 9988776609")

In [62]:
u=cursor.execute("select *from student_learningdata WHERE phone_number between 9988776604 and 9988776609")
for c in u:
    print(c)

(9988776604, 'student4@gmail.com', 'tablue', 38000)
(9988776605, 'student5@gmail.com', 'tablue', 133000)
(9988776606, 'student6@gmail.com', 'tablue', 34000)
(9988776607, 'student7@gmail.com', 'tablue', 33000)
(9988776608, 'student8@gmail.com', 'tablue', 129000)
(9988776609, 'student9@gmail.com', 'tablue', 110000)

In [65]:
new=cursor.execute("SELECT phone_number,course_name from student_learningdata where phone_number between 9988776604 and 9988776609")
for q in new:
    print(q)

(9988776604, 'tablue')
(9988776605, 'tablue')
(9988776606, 'tablue')
(9988776607, 'tablue')
(9988776608, 'tablue')
(9988776609, 'tablue')

## MIN & MAX functions

In [68]:
r=cursor.execute("select min(fee_paid) from student_learningdata")

In [69]:
print(r)

<sqlite3.Cursor object at 0x0000021499EE4B90>

In [73]:
print('min. fee paid',r.fetchone())

min. fee paid (23000,)

In [75]:
rr=cursor.execute('select max(fee_paid) from student_learningdata')

print('max fee paid',rr.fetchone())

max fee paid (140000,)

In [76]:
f=cursor.execute('select * from student_learningdata')
for c in f:
    print(c)

(987654321, 'qwerty123@gmail.com', 'data science', 50000)
(482959, 'mukul@gmail.com', 'software developer', 100000)
(9988776604, 'student4@gmail.com', 'tablue', 38000)
(9988776605, 'student5@gmail.com', 'tablue', 133000)
(9988776606, 'student6@gmail.com', 'tablue', 34000)
(9988776607, 'student7@gmail.com', 'tablue', 33000)
(9988776608, 'student8@gmail.com', 'tablue', 129000)
(9988776609, 'student9@gmail.com', 'tablue', 110000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 110000)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Digital Marketing', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [79]:
r=cursor.execute('select min(fee_paid) from student_learningdata')
print(r.fetchone())

(23000,)

In [80]:
r=cursor.execute('select max(fee_paid) from student_learningdata')
print(r.fetchone())

(140000,)

In [93]:
cursor.execute('create table course1(courseid int primary key,coursename text,duration int)')

In [94]:
cursor.execute("create table student1(roll_no int primary key,studentname text,age int,courseid int,foreign key(courseid) references course1(courseid) )")

In [95]:
cursor.execute("insert into course1 values(78,'data science',12),(56,'python course',4),(101,'database',7)")
db.commit

In [96]:
print(cursor.rowcount)

3

In [97]:
w=cursor.execute('select *from course1')
for t in w:
    print(t)

(78, 'data science', 12)
(56, 'python course', 4)
(101, 'database', 7)

In [98]:
cursor.execute("insert into student1 values(1,'jack',22,78),(2,'john',21,56),(3,'rudolf',18,78),(4,'jim',21,56)")
db.commit

In [99]:
print(cursor.rowcount)

4

In [100]:
l=cursor.execute('select *from student1')
for e in l:
    print(e)

(1, 'jack', 22, 78)
(2, 'john', 21, 56)
(3, 'rudolf', 18, 78)
(4, 'jim', 21, 56)

In [104]:
r=cursor.execute("select * from course1 where coursename='python course'")
for h in r:
    print(h)

(56, 'python course', 4)

In [105]:
w=cursor.execute("select courseid from course1 where coursename='python course'")
for e in w:
    print(e)

(56,)

In [106]:
result=cursor.execute("select * from student1 where courseid=(select courseid from course1 where coursename='data science')")
result.fetchall()

[(1, 'jack', 22, 78), (3, 'rudolf', 18, 78)]

In [107]:
cursor.execute('insert into student1 values(12,"mukul",23,101)')
db.commit

In [108]:
qw=cursor.execute('select * from student1')
for t in qw:
    print(t)

(1, 'jack', 22, 78)
(2, 'john', 21, 56)
(3, 'rudolf', 18, 78)
(4, 'jim', 21, 56)
(12, 'mukul', 23, 101)

In [111]:
r=cursor.execute("select * from course1 where courseid=(select courseid from student1 where studentname='mukul' )")
r.fetchall()

[(101, 'database', 7)]

In [114]:
n=cursor.execute('select * from student1 where courseid=(select courseid from course1 where coursename="database")')
n.fetchall()

[(12, 'mukul', 23, 101)]

In [115]:
n=cursor.execute('select * from student1 where courseid=(select courseid from course1 where coursename="database")')
n.fetchall()

[(12, 'mukul', 23, 101)]

### join

In [145]:
cursor.execute('drop table stud_det')

In [146]:
cursor.execute("create table stud_det( phone_number int primary key, student_name text, enrolled_date text, marks int)")
with open('Students_details.txt','r') as file:
    no_records=0
    for row in file:
        cursor.execute("insert into stud_det values(?,?,?,?)", row.split(","))
        db.commit()
        no_records+=1
        
print(no_records,'records inserted')

20 records inserted

In [147]:
s=cursor.execute('select* from stud_det')
for r in s:
    print(r)

(9988776604, 'Salah', '03-10-2020', 85)
(9988776605, 'Heung-Son', '21-06-2020', 39)
(9988776606, 'Ronaldo', '08-05-2020', 86)
(9988776607, 'Kane', '11-05-2022', 57)
(9988776608, 'Mane', '17-05-2022', 52)
(6609998877, 'Vardy', '17-12-2020', 54)
(6609998878, 'Jota', '06-11-2021', 45)
(6609998879, 'Bruyne', '26-11-2020', 49)
(6609998880, 'Zaha', '05-12-2020', 88)
(6609998881, 'Sterling', '29-10-2020', 61)
(9988776614, 'Toney', '31-03-2022', 71)
(9988776615, 'Maddison', '10-03-2020', 44)
(1687799866, 'Bowen', '14-02-2021', 96)
(1687799867, 'Saka', '19-12-2022', 92)
(1687799868, 'Watkins', '30-01-2021', 49)
(1687799869, 'Mount', '16-09-2022', 48)
(1687799870, 'Raphael', '15-05-2021', 50)
(1687799871, 'Mahrez', '30-10-2021', 72)
(9988776622, 'Pukki', '19-02-2021', 93)
(9988776623, 'Fernandes', '01-03-2022', 94)

In [148]:
o=cursor.execute('select * from student_learningdata')
for g in o:
    print(g)

(987654321, 'qwerty123@gmail.com', 'data science', 50000)
(482959, 'mukul@gmail.com', 'software developer', 100000)
(9988776604, 'student4@gmail.com', 'tablue', 38000)
(9988776605, 'student5@gmail.com', 'tablue', 133000)
(9988776606, 'student6@gmail.com', 'tablue', 34000)
(9988776607, 'student7@gmail.com', 'tablue', 33000)
(9988776608, 'student8@gmail.com', 'tablue', 129000)
(9988776609, 'student9@gmail.com', 'tablue', 110000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 110000)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Digital Marketing', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [149]:
s=cursor.execute("SELECT student_learningdata.phone_number,stud_det.enrolled_date,stud_det.marks,stud_det.student_name FROM stud_det INNER JOIN student_learningdata ON student_learningdata.phone_number=stud_det.phone_number")
for row in s:
    print(row)

(9988776604, '03-10-2020', 85, 'Salah')
(9988776605, '21-06-2020', 39, 'Heung-Son')
(9988776606, '08-05-2020', 86, 'Ronaldo')
(9988776607, '11-05-2022', 57, 'Kane')
(9988776608, '17-05-2022', 52, 'Mane')
(9988776614, '31-03-2022', 71, 'Toney')
(9988776615, '10-03-2020', 44, 'Maddison')
(9988776622, '19-02-2021', 93, 'Pukki')
(9988776623, '01-03-2022', 94, 'Fernandes')

In [150]:
sw=cursor.execute("SELECT student_learningdata.phone_number,stud_det.enrolled_date,stud_det.marks,stud_det.student_name FROM stud_det LEFT JOIN student_learningdata ON student_learningdata.phone_number=stud_det.phone_number")
for row in sw:
    print(row)

(9988776604, '03-10-2020', 85, 'Salah')
(9988776605, '21-06-2020', 39, 'Heung-Son')
(9988776606, '08-05-2020', 86, 'Ronaldo')
(9988776607, '11-05-2022', 57, 'Kane')
(9988776608, '17-05-2022', 52, 'Mane')
(None, '17-12-2020', 54, 'Vardy')
(None, '06-11-2021', 45, 'Jota')
(None, '26-11-2020', 49, 'Bruyne')
(None, '05-12-2020', 88, 'Zaha')
(None, '29-10-2020', 61, 'Sterling')
(9988776614, '31-03-2022', 71, 'Toney')
(9988776615, '10-03-2020', 44, 'Maddison')
(None, '14-02-2021', 96, 'Bowen')
(None, '19-12-2022', 92, 'Saka')
(None, '30-01-2021', 49, 'Watkins')
(None, '16-09-2022', 48, 'Mount')
(None, '15-05-2021', 50, 'Raphael')
(None, '30-10-2021', 72, 'Mahrez')
(9988776622, '19-02-2021', 93, 'Pukki')
(9988776623, '01-03-2022', 94, 'Fernandes')

In [151]:
Qs=cursor.execute("SELECT student_learningdata.phone_number,stud_det.enrolled_date,stud_det.marks,stud_det.student_name FROM stud_det RIGHT JOIN student_learningdata ON student_learningdata.phone_number=stud_det.phone_number")
for row in Qs:
    print(row)

OperationalError: RIGHT and FULL OUTER JOINs are not currently supported

In [152]:
s=cursor.execute("SELECT student_learningdata.phone_number,*from stud_det INNER JOIN student_learningdata ON student_learningdata.phone_number=stud_det.phone_number")
for row in s:
    print(row)

(9988776604, 9988776604, 'Salah', '03-10-2020', 85, 9988776604, 'student4@gmail.com', 'tablue', 38000)
(9988776605, 9988776605, 'Heung-Son', '21-06-2020', 39, 9988776605, 'student5@gmail.com', 'tablue', 133000)
(9988776606, 9988776606, 'Ronaldo', '08-05-2020', 86, 9988776606, 'student6@gmail.com', 'tablue', 34000)
(9988776607, 9988776607, 'Kane', '11-05-2022', 57, 9988776607, 'student7@gmail.com', 'tablue', 33000)
(9988776608, 9988776608, 'Mane', '17-05-2022', 52, 9988776608, 'student8@gmail.com', 'tablue', 129000)
(9988776614, 9988776614, 'Toney', '31-03-2022', 71, 9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 9988776615, 'Maddison', '10-03-2020', 44, 9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776622, 9988776622, 'Pukki', '19-02-2021', 93, 9988776622, 'student22@gmail.com', 'Digital Marketing', 23000)
(9988776623, 9988776623, 'Fernandes', '01-03-2022', 94, 9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [160]:
s=cursor.execute("SELECT stud_det.phone_number,* FROM student_learningdata INNER JOIN stud_det on stud_det.phone_number=student_learningdata.phone_number")
for row in s:
    print(row)

(9988776604, 9988776604, 'student4@gmail.com', 'tablue', 38000, 9988776604, 'Salah', '03-10-2020', 85)
(9988776605, 9988776605, 'student5@gmail.com', 'tablue', 133000, 9988776605, 'Heung-Son', '21-06-2020', 39)
(9988776606, 9988776606, 'student6@gmail.com', 'tablue', 34000, 9988776606, 'Ronaldo', '08-05-2020', 86)
(9988776607, 9988776607, 'student7@gmail.com', 'tablue', 33000, 9988776607, 'Kane', '11-05-2022', 57)
(9988776608, 9988776608, 'student8@gmail.com', 'tablue', 129000, 9988776608, 'Mane', '17-05-2022', 52)
(9988776614, 9988776614, 'student14@gmail.com', 'Data Science', 24000, 9988776614, 'Toney', '31-03-2022', 71)
(9988776615, 9988776615, 'student15@gmail.com', 'Data Science', 23000, 9988776615, 'Maddison', '10-03-2020', 44)
(9988776622, 9988776622, 'student22@gmail.com', 'Digital Marketing', 23000, 9988776622, 'Pukki', '19-02-2021', 93)
(9988776623, 9988776623, 'student23@gmail.com', 'Data Science', 24000, 9988776623, 'Fernandes', '01-03-2022', 94)

In [157]:
sql=cursor.execute('select student_learningdata.phone_number,stud_det.enrolled_date,stud_det.marks,stud_det.student_name from stud_det inner join student_learningdata on student_learningdata.phone_number=stud_det.phone_number')
for h in sql:
    print(h)

(9988776604, '03-10-2020', 85, 'Salah')
(9988776605, '21-06-2020', 39, 'Heung-Son')
(9988776606, '08-05-2020', 86, 'Ronaldo')
(9988776607, '11-05-2022', 57, 'Kane')
(9988776608, '17-05-2022', 52, 'Mane')
(9988776614, '31-03-2022', 71, 'Toney')
(9988776615, '10-03-2020', 44, 'Maddison')
(9988776622, '19-02-2021', 93, 'Pukki')
(9988776623, '01-03-2022', 94, 'Fernandes')

In [159]:
sql=cursor.execute('select student_learningdata.phone_number,stud_det.enrolled_date,stud_det.marks,stud_det.student_name from student_learningdata inner join stud_det on stud_det.phone_number=student_learningdata.phone_number')
for h in sql:
    print(h)

(9988776604, '03-10-2020', 85, 'Salah')
(9988776605, '21-06-2020', 39, 'Heung-Son')
(9988776606, '08-05-2020', 86, 'Ronaldo')
(9988776607, '11-05-2022', 57, 'Kane')
(9988776608, '17-05-2022', 52, 'Mane')
(9988776614, '31-03-2022', 71, 'Toney')
(9988776615, '10-03-2020', 44, 'Maddison')
(9988776622, '19-02-2021', 93, 'Pukki')
(9988776623, '01-03-2022', 94, 'Fernandes')